{
  "backend/main.mo": "Motoko actor that manages contact requests with functions to submit, retrieve by ID, and get all contact requests using a Map data structure.",
  "feature_evidence.json": "Feature evidence report documenting the update of years of experience references to '12 years' or '12+ years' across the website, with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components, styling, SEO configuration, and contact functionality for the Talentblaze website.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes with warm amber/orange palette and improved contrast ratios.",
  "frontend/index.html": "HTML entry point with comprehensive SEO meta tags, Open Graph tags, Twitter Card tags, canonical URL, and JSON-LD structured data for Talentblaze.",
  "frontend/public/robots.txt": "Robots.txt file allowing all search engine crawlers unrestricted access to the entire site.",
  "frontend/src/App.tsx": "Main React application component that composes Hero, About, Services, Contact, and Footer sections into a single-page layout.",
  "frontend/src/components/AboutSection.tsx": "About section explaining fractional talent acquisition model with value proposition cards highlighting cost effectiveness, flexibility, India market expertise, and proven processes.",
  "frontend/src/components/ContactSection.tsx": "Contact section with form for submitting inquiries and contact cards displaying email and location, integrated with backend mutation hooks.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright, year, and attribution link to caffeine.ai with enhanced text contrast.",
  "frontend/src/components/HeroSection.tsx": "Hero section featuring gradient-styled 'Talentblaze' branding, icon-based infographic background, trust indicators showing 12+ years of experience, and call-to-action buttons.",
  "frontend/src/components/ServicesSection.tsx": "Displays comprehensive talent acquisition services in three categories: core services (recruitment, consulting, process optimization, etc.), startup-specific services, and global services for India market entry.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an ICP backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow, identity state, and auth client lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for contact request operations: submitting new requests, fetching all requests, and fetching individual requests by ID using the ICP actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables defining a warm amber/orange theme for both light and dark modes, plus base styles and utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom fonts (Inter), OKLCH color system, border radius variables, shadows, and animations for accordion components.",
  "project_state.json": "Project metadata describing Talentblaze as a fractional talent acquisition service website targeting Indian startups and global firms, tracking implemented features and known issues like placeholder data."
}