{
  "backend/main.mo": "Motoko actor defining a contact request storage system with functions to submit, retrieve by ID, and list all contact requests using a Map-based store with auto-incrementing IDs.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: adding a visually appealing background with warm amber/orange color scheme, and updating the contact email to hellotalentblaze@yahoo.com.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the single-page Talentblaze application with hero, about, services, contact sections, SEO optimization, and warm amber/orange branding.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode color variables using neutral tones (no amber/orange in CSS variables themselves).",
  "frontend/index.html": "HTML entry point with comprehensive SEO meta tags, Open Graph tags, Twitter Card tags, canonical URL, and JSON-LD structured data for Talentblaze's fractional talent acquisition services.",
  "frontend/public/robots.txt": "Robots.txt file allowing all search engine crawlers unrestricted access to index the entire site.",
  "frontend/src/App.tsx": "Main React application component composing HeroSection, AboutSection, ServicesSection, ContactSection, and Footer into a single-page layout.",
  "frontend/src/components/AboutSection.tsx": "About section explaining fractional talent acquisition model with value proposition cards highlighting cost effectiveness, flexibility, India market expertise, and proven processes.",
  "frontend/src/components/ContactSection.tsx": "Contact section with form submission using React Query mutation, displaying email (hellotalentblaze@yahoo.com) and location cards, with success state handling.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright, year, and attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/HeroSection.tsx": "Hero section component with gradient background, decorative icons, and CTA buttons that displays the Talentblaze branding and value proposition for fractional talent acquisition services in India.",
  "frontend/src/components/ServicesSection.tsx": "Services section component that displays core recruitment services (end-to-end recruitment, talent strategy, process optimization, etc.) and specialized offerings for startups and global companies in a card grid layout.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the ICP actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for contact request operations including submission mutation and queries to fetch all or individual contact requests from the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables defining a warm amber/orange theme for both light and dark modes, plus gradient backgrounds and utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom OKLCH colors, Inter font family, container settings, border radius variables, shadows, and animations for accordions.",
  "project_state.json": "Project state file tracking 15 versions of a Talentblaze website for fractional talent acquisition services targeting Indian startups and global firms. Contains 10 implemented features including homepage, about/services/contact sections, visual theming, and data replacement with known issues about placeholder data and contact number display."
}